janhavelka/AT21CS11/test/test_esp32_transport.cpp
#include <cstddef>
#include <cstdint>
#include <limits>

#include <unity.h>

#include "AT21CS/platform/esp32/Esp32Transport.h"
#include "support/TestAccess.h"

using namespace AT21CS;
using AT21CS::test::TestAccess;

namespace {

SingleWireTransfer addressOnly(SpeedMode speed = SpeedMode::HIGH_SPEED) {
  SingleWireTransfer transfer{};
  transfer.speed = speed;
  transfer.deviceAddress = 0xA0;
  transfer.minimumPostTransferHighUs =
      speed == SpeedMode::HIGH_SPEED ? 160 : 650;
  return transfer;
}

void queueLevel(Esp32Transport& transport, bool high) {
  TEST_ASSERT_TRUE(TestAccess::queueLineLevel(transport, high));
}

void assertCodePhase(const TransferResult& result,
                     TransportCode code,
                     TransferPhase phase) {
  TEST_ASSERT_EQUAL_UINT8(static_cast<uint8_t>(code),
                          static_cast<uint8_t>(result.code));
  TEST_ASSERT_EQUAL_UINT8(static_cast<uint8_t>(phase),
                          static_cast<uint8_t>(result.phase));
}

uint16_t collectLowEvents(const Esp32Transport& transport,
                          uint16_t* indices,
                          uint16_t capacity) {
  uint16_t count = 0;
  for (uint16_t index = 0; index < TestAccess::lineEventCount(transport);
       ++index) {
    if (!TestAccess::lineEventReleased(transport, index)) {
      TEST_ASSERT_LESS_THAN_UINT16(capacity, count);
      indices[count++] = index;
    }
  }
  return count;
}

}  // namespace

void test_esp32_timing_profiles_and_pin_ranges_are_exact() {
  TEST_ASSERT_EQUAL_UINT32(64000,
                           TestAccess::bitNs(SpeedMode::STANDARD_SPEED));
  TEST_ASSERT_EQUAL_UINT32(32000,
                           TestAccess::low0Ns(SpeedMode::STANDARD_SPEED));
  TEST_ASSERT_EQUAL_UINT32(6000,
                           TestAccess::low1Ns(SpeedMode::STANDARD_SPEED));
  TEST_ASSERT_EQUAL_UINT32(6000,
                           TestAccess::readLowNs(SpeedMode::STANDARD_SPEED));
  TEST_ASSERT_EQUAL_UINT32(7000,
                           TestAccess::readSampleNs(
                               SpeedMode::STANDARD_SPEED));
  TEST_ASSERT_EQUAL_UINT32(650,
                           TestAccess::startHighUs(
                               SpeedMode::STANDARD_SPEED));

  TEST_ASSERT_EQUAL_UINT32(16000,
                           TestAccess::bitNs(SpeedMode::HIGH_SPEED));
  TEST_ASSERT_EQUAL_UINT32(10000,
                           TestAccess::low0Ns(SpeedMode::HIGH_SPEED));
  TEST_ASSERT_EQUAL_UINT32(1500,
                           TestAccess::low1Ns(SpeedMode::HIGH_SPEED));
  TEST_ASSERT_EQUAL_UINT32(1200,
                           TestAccess::readLowNs(SpeedMode::HIGH_SPEED));
  TEST_ASSERT_EQUAL_UINT32(1800,
                           TestAccess::readSampleNs(SpeedMode::HIGH_SPEED));
  TEST_ASSERT_EQUAL_UINT32(160,
                           TestAccess::startHighUs(SpeedMode::HIGH_SPEED));

  TEST_ASSERT_EQUAL_UINT32(120, TestAccess::cyclesForNs(1500, 80));
  TEST_ASSERT_EQUAL_UINT32(240, TestAccess::cyclesForNs(1500, 160));
  TEST_ASSERT_EQUAL_UINT32(360, TestAccess::cyclesForNs(1500, 240));
  TEST_ASSERT_EQUAL_UINT32(144, TestAccess::cyclesForNs(1800, 80));
  TEST_ASSERT_EQUAL_UINT32(288, TestAccess::cyclesForNs(1800, 160));
  TEST_ASSERT_EQUAL_UINT32(432, TestAccess::cyclesForNs(1800, 240));

  Esp32TransportConfig config{};
  config.sioPin = 0;
  TEST_ASSERT_TRUE(TestAccess::pinNumbersInRange(config, 49));
  config.sioPin = 31;
  TEST_ASSERT_TRUE(TestAccess::pinNumbersInRange(config, 47));
  config.sioPin = 32;
  TEST_ASSERT_TRUE(TestAccess::pinNumbersInRange(config, 47));
  config.sioPin = 46;
  TEST_ASSERT_TRUE(TestAccess::pinNumbersInRange(config, 47));
  config.sioPin = 47;
  TEST_ASSERT_FALSE(TestAccess::pinNumbersInRange(config, 47));
  config.sioPin = 48;
  config.presencePin = 47;
  TEST_ASSERT_TRUE(TestAccess::pinNumbersInRange(config, 49));
  config.sioPin = -1;
  TEST_ASSERT_FALSE(TestAccess::pinNumbersInRange(config, 49));
  config.sioPin = 49;
  TEST_ASSERT_FALSE(TestAccess::pinNumbersInRange(config, 49));
  config.sioPin = std::numeric_limits<int>::max();
  TEST_ASSERT_FALSE(TestAccess::pinNumbersInRange(config, 49));
  config.sioPin = 1;
  config.presencePin = -2;
  TEST_ASSERT_FALSE(TestAccess::pinNumbersInRange(config, 49));
  config.presencePin = std::numeric_limits<int>::min();
  TEST_ASSERT_FALSE(TestAccess::pinNumbersInRange(config, 49));
  config.presencePin = 49;
  TEST_ASSERT_FALSE(TestAccess::pinNumbersInRange(config, 49));
  config.presencePin = config.sioPin;
  TEST_ASSERT_FALSE(TestAccess::pinNumbersInRange(config, 49));
}

void test_esp32_transfer_validation_and_wait_guards_are_bounded() {
  Esp32Transport transport;
  TestAccess::activateWithoutHardware(transport, -1);

  uint8_t byte = 0;
  SingleWireTransfer invalid = addressOnly();
  invalid.txData = &byte;
  invalid.txLength = std::numeric_limits<size_t>::max();
  const TransferResult invalidResult =
      TestAccess::transfer(transport, invalid, 1000);
  assertCodePhase(invalidResult, TransportCode::IO_ERROR,
                  TransferPhase::NONE);
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::lineEventCount(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  const TransferResult insufficientDeadline =
      TestAccess::transfer(transport, addressOnly(), 160);
  assertCodePhase(insufficientDeadline, TransportCode::TIMEOUT,
                  TransferPhase::START);
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::lineEventCount(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, false);
  queueLevel(transport, true);
  const TransferResult hugeDeadline = TestAccess::transfer(
      transport, addressOnly(), std::numeric_limits<uint64_t>::max() - 1u);
  assertCodePhase(hugeDeadline, TransportCode::OK,
                  TransferPhase::STOP);
  TEST_ASSERT_TRUE(hugeDeadline.firstDeviceAddressAcked);
  TEST_ASSERT_TRUE(hugeDeadline.stopCompleted);

  TestAccess::activateWithoutHardware(transport, -1);
  TestAccess::setNowUs(transport, 100);
  const TransferResult tooLong = TestAccess::waitUntilUs(transport, 10101);
  assertCodePhase(tooLong, TransportCode::TIMEOUT,
                  TransferPhase::WAIT_HIGH);
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::lineEventCount(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  TestAccess::setNowUs(transport, 100);
  const TransferResult completed = TestAccess::waitUntilUs(transport, 260);
  assertCodePhase(completed, TransportCode::OK,
                  TransferPhase::WAIT_HIGH);
  TEST_ASSERT_EQUAL_UINT64(260, TestAccess::nowUs(transport));
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));
  TEST_ASSERT_EQUAL_UINT16(1,
                           TestAccess::timingLockAcquireCount(transport));
  TEST_ASSERT_EQUAL_UINT16(1,
                           TestAccess::timingLockReleaseCount(transport));
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::timingLockDepth(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  TestAccess::setNowUs(transport, 100);
  queueLevel(transport, false);
  const TransferResult heldLow = TestAccess::waitUntilUs(transport, 100);
  assertCodePhase(heldLow, TransportCode::LINE_STUCK,
                  TransferPhase::WAIT_HIGH);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  TestAccess::setNowUs(transport, 100);
  TestAccess::freezeClock(transport, true);
  const TransferResult frozenBefore =
      TestAccess::waitUntilUs(transport, 260);
  assertCodePhase(frozenBefore, TransportCode::TIMEOUT,
                  TransferPhase::WAIT_HIGH);
  TEST_ASSERT_EQUAL_INT32(TestAccess::frozenClockDetail(),
                          frozenBefore.detail);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  TestAccess::setNowUs(transport, 100);
  TestAccess::freezeAfterCoarseDelay(transport, 159);
  const TransferResult frozenAfter =
      TestAccess::waitUntilUs(transport, 260);
  assertCodePhase(frozenAfter, TransportCode::TIMEOUT,
                  TransferPhase::WAIT_HIGH);
  TEST_ASSERT_EQUAL_INT32(TestAccess::frozenClockDetail(),
                          frozenAfter.detail);
  TEST_ASSERT_EQUAL_UINT32(100000,
                           TestAccess::finalWaitPollLimit());
  TEST_ASSERT_EQUAL_UINT32(2000, TestAccess::finalWaitGuardUs());
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  TestAccess::setNowUs(transport, 100);
  TestAccess::freezeClock(transport, true);
  TestAccess::setNowCallCycles(transport, 2);
  const TransferResult cycleGuard =
      TestAccess::waitUntilUs(transport, 260);
  assertCodePhase(cycleGuard, TransportCode::TIMEOUT,
                  TransferPhase::WAIT_HIGH);
  TEST_ASSERT_EQUAL_INT32(TestAccess::frozenClockDetail(),
                          cycleGuard.detail);
  TEST_ASSERT_LESS_THAN_UINT32(
      160u * 240u + TestAccess::finalWaitPollLimit() * 3u,
      TestAccess::cycle(transport));
  TEST_ASSERT_EQUAL_UINT16(1,
                           TestAccess::timingLockAcquireCount(transport));
  TEST_ASSERT_EQUAL_UINT16(1,
                           TestAccess::timingLockReleaseCount(transport));
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::timingLockDepth(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  TestAccess::failTimingLock(transport, true);
  const TransferResult lockFailure =
      TestAccess::transfer(transport, addressOnly(), 5000);
  assertCodePhase(lockFailure, TransportCode::IO_ERROR,
                  TransferPhase::START);
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::lineEventCount(transport));
  TEST_ASSERT_EQUAL_UINT16(1,
                           TestAccess::timingLockAcquireCount(transport));
  TEST_ASSERT_EQUAL_UINT16(0,
                           TestAccess::timingLockReleaseCount(transport));
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::timingLockDepth(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  TestAccess::setNowUs(transport, 100);
  TestAccess::setNowCallCycles(transport, 240);
  TEST_ASSERT_FALSE(TestAccess::beginSegment(transport, 101));
}

