janhavelka/AT21CS11/test/test_esp32_transport.cpp
void test_esp32_bit_slots_are_preflighted_before_falling_edges() {
  Esp32Transport writeTransport;
  TestAccess::activateWithoutHardware(writeTransport, -1);
  queueLevel(writeTransport, true);

  const TransferResult writeResult =
      TestAccess::transfer(writeTransport, addressOnly(), 171);
  assertCodePhase(writeResult, TransportCode::TIMEOUT,
                  TransferPhase::DEVICE_ADDRESS_WRITE);
  uint16_t writeLowIndices[2]{};
  TEST_ASSERT_EQUAL_UINT16(
      0, collectLowEvents(writeTransport, writeLowIndices, 2));
  TEST_ASSERT_TRUE(TestAccess::lineReleased(writeTransport));

  Esp32Transport ackTransport;
  TestAccess::activateWithoutHardware(ackTransport, -1);
  queueLevel(ackTransport, true);

  const TransferResult ackResult =
      TestAccess::transfer(ackTransport, addressOnly(), 299);
  assertCodePhase(ackResult, TransportCode::TIMEOUT,
                  TransferPhase::DEVICE_ADDRESS_WRITE);
  uint16_t lowIndices[12]{};
  TEST_ASSERT_EQUAL_UINT16(
      8, collectLowEvents(ackTransport, lowIndices, 12));
  TEST_ASSERT_TRUE(TestAccess::lineReleased(ackTransport));
  TEST_ASSERT_EQUAL_UINT16(1, TestAccess::readCount(ackTransport));
}

void test_esp32_reset_discovery_has_one_exact_request_and_release_check() {
  Esp32Transport transport;
  TestAccess::activateWithoutHardware(transport, -1);
  bool present = true;
  const TransferResult insufficientDeadline =
      TestAccess::resetAndDiscover(transport, present, 795);
  assertCodePhase(insufficientDeadline, TransportCode::TIMEOUT,
                  TransferPhase::RESET_LOW);
  TEST_ASSERT_FALSE(present);
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::lineEventCount(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  TestAccess::failTimingLock(transport, true);
  present = true;
  const TransferResult lockFailure =
      TestAccess::resetAndDiscover(transport, present, 5000);
  assertCodePhase(lockFailure, TransportCode::IO_ERROR,
                  TransferPhase::RESET_LOW);
  TEST_ASSERT_FALSE(present);
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::lineEventCount(transport));
  TEST_ASSERT_EQUAL_UINT16(1,
                           TestAccess::timingLockAcquireCount(transport));
  TEST_ASSERT_EQUAL_UINT16(0,
                           TestAccess::timingLockReleaseCount(transport));
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::timingLockDepth(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, false);
  queueLevel(transport, true);
  queueLevel(transport, true);

  present = false;
  const TransferResult result =
      TestAccess::resetAndDiscover(transport, present, 5000);
  assertCodePhase(result, TransportCode::OK,
                  TransferPhase::DISCOVERY_RELEASE);
  TEST_ASSERT_TRUE(present);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));
  TEST_ASSERT_FALSE(TestAccess::testOverflow(transport));

  uint16_t lowIndices[4]{};
  TEST_ASSERT_EQUAL_UINT16(
      2, collectLowEvents(transport, lowIndices, 4));
  const uint16_t discoveryLow = lowIndices[1];
  TEST_ASSERT_EQUAL_UINT32(146400,
                           TestAccess::lineEventCycle(transport,
                                                      discoveryLow));
  TEST_ASSERT_TRUE(
      TestAccess::lineEventReleased(transport, discoveryLow + 1u));
  TEST_ASSERT_EQUAL_UINT32(
      288,
      TestAccess::lineEventCycle(transport, discoveryLow + 1u) -
          TestAccess::lineEventCycle(transport, discoveryLow));
  TEST_ASSERT_EQUAL_UINT16(3, TestAccess::readCount(transport));
  TEST_ASSERT_EQUAL_UINT32(
      960, TestAccess::readCycle(transport, 0) -
               TestAccess::lineEventCycle(transport, discoveryLow));
  TEST_ASSERT_EQUAL_UINT32(
      7200, TestAccess::readCycle(transport, 1) -
                TestAccess::lineEventCycle(transport, discoveryLow));
  TEST_ASSERT_EQUAL_UINT32(
      38400, TestAccess::readCycle(transport, 2) -
                 TestAccess::readCycle(transport, 1));
  TEST_ASSERT_EQUAL_UINT16(1,
                           TestAccess::timingLockAcquireCount(transport));
  TEST_ASSERT_EQUAL_UINT16(1,
                           TestAccess::timingLockReleaseCount(transport));
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::timingLockDepth(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, false);
  queueLevel(transport, false);
  present = true;
  const TransferResult stuck =
      TestAccess::resetAndDiscover(transport, present, 5000);
  assertCodePhase(stuck, TransportCode::LINE_STUCK,
                  TransferPhase::DISCOVERY_RELEASE);
  TEST_ASSERT_FALSE(present);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));
  TEST_ASSERT_EQUAL_UINT16(
      2, collectLowEvents(transport, lowIndices, 4));

  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, true);
  queueLevel(transport, true);
  present = true;
  const TransferResult absent =
      TestAccess::resetAndDiscover(transport, present, 5000);
  assertCodePhase(absent, TransportCode::OK,
                  TransferPhase::DISCOVERY_RELEASE);
  TEST_ASSERT_FALSE(present);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));
  TEST_ASSERT_EQUAL_UINT16(
      2, collectLowEvents(transport, lowIndices, 4));
}

void test_esp32_high_speed_frame_is_msb_first_and_samples_ack_absolutely() {
  Esp32Transport transport;
  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, false);
  queueLevel(transport, true);

  const TransferResult result =
      TestAccess::transfer(transport, addressOnly(), 5000);
  assertCodePhase(result, TransportCode::OK, TransferPhase::STOP);
  TEST_ASSERT_TRUE(result.firstDeviceAddressAcked);
  TEST_ASSERT_TRUE(result.stopCompleted);

  uint16_t lowIndices[12]{};
  TEST_ASSERT_EQUAL_UINT16(
      9, collectLowEvents(transport, lowIndices, 12));
  const bool expectedBits[8] = {true, false, true, false,
                                false, false, false, false};
  for (uint16_t bit = 0; bit < 8; ++bit) {
    const uint16_t lowIndex = lowIndices[bit];
    TEST_ASSERT_TRUE(TestAccess::lineEventReleased(transport,
                                                   lowIndex + 1u));
    const uint32_t lowCycles =
        TestAccess::lineEventCycle(transport, lowIndex + 1u) -
        TestAccess::lineEventCycle(transport, lowIndex);
    TEST_ASSERT_EQUAL_UINT32(expectedBits[bit] ? 360 : 2400,
                             lowCycles);
    if (bit != 0) {
      TEST_ASSERT_EQUAL_UINT32(
          3840,
          TestAccess::lineEventCycle(transport, lowIndex) -
              TestAccess::lineEventCycle(transport, lowIndices[bit - 1u]));
    }
  }
  const uint16_t ackLow = lowIndices[8];
  TEST_ASSERT_EQUAL_UINT32(
      288, TestAccess::lineEventCycle(transport, ackLow + 1u) -
               TestAccess::lineEventCycle(transport, ackLow));
  TEST_ASSERT_EQUAL_UINT32(
      432, TestAccess::readCycle(transport, 1) -
               TestAccess::lineEventCycle(transport, ackLow));
  TEST_ASSERT_EQUAL_UINT32(38400,
                           TestAccess::lineEventCycle(transport,
                                                      lowIndices[0]));
  const uint16_t finalHighEvent =
      static_cast<uint16_t>(TestAccess::lineEventCount(transport) - 1u);
  TEST_ASSERT_EQUAL_UINT32(
      38400, TestAccess::readCycle(transport, 2) -
                 TestAccess::lineEventCycle(transport, finalHighEvent));
}

void test_esp32_write_ack_boundaries_preserve_ambiguous_and_definite_evidence() {
  const uint8_t payload = 0x5A;
  SingleWireTransfer transfer = addressOnly();
  transfer.txData = &payload;
  transfer.txLength = 1;

