janhavelka/AT21CS11/test/test_esp32_transport.cpp
  Esp32Transport transport;
  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, false);
  TransferResult result = TestAccess::transfer(transport, transfer, 320);
  assertCodePhase(result, TransportCode::TIMEOUT,
                  TransferPhase::DATA_WRITE);
  TEST_ASSERT_TRUE(result.firstDeviceAddressAcked);
  TEST_ASSERT_EQUAL_UINT32(0, result.dataBytesTransferred);
  TEST_ASSERT_FALSE(result.currentWriteByteMayBeAccepted);
  TEST_ASSERT_FALSE(result.stopCompleted);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, false);
  result = TestAccess::transfer(transport, transfer, 433);
  assertCodePhase(result, TransportCode::TIMEOUT,
                  TransferPhase::DATA_WRITE);
  TEST_ASSERT_TRUE(result.firstDeviceAddressAcked);
  TEST_ASSERT_EQUAL_UINT32(0, result.dataBytesTransferred);
  TEST_ASSERT_TRUE(result.currentWriteByteMayBeAccepted);
  TEST_ASSERT_FALSE(result.stopCompleted);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, false);
  queueLevel(transport, true);
  result = TestAccess::transfer(transport, transfer, 449);
  assertCodePhase(result, TransportCode::NACK,
                  TransferPhase::DATA_WRITE);
  TEST_ASSERT_TRUE(result.firstDeviceAddressAcked);
  TEST_ASSERT_EQUAL_UINT32(0, result.dataBytesTransferred);
  TEST_ASSERT_FALSE(result.currentWriteByteMayBeAccepted);
  TEST_ASSERT_FALSE(result.stopCompleted);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));

  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, false);
  queueLevel(transport, false);
  result = TestAccess::transfer(transport, transfer, 449);
  assertCodePhase(result, TransportCode::TIMEOUT, TransferPhase::STOP);
  TEST_ASSERT_TRUE(result.firstDeviceAddressAcked);
  TEST_ASSERT_EQUAL_UINT32(1, result.dataBytesTransferred);
  TEST_ASSERT_FALSE(result.currentWriteByteMayBeAccepted);
  TEST_ASSERT_FALSE(result.stopCompleted);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));
}

void test_esp32_direct_read_uses_host_nack_and_commits_complete_prefix() {
  uint8_t output = 0;
  SingleWireTransfer transfer{};
  transfer.speed = SpeedMode::HIGH_SPEED;
  transfer.deviceAddress = 0xA1;
  transfer.rxData = &output;
  transfer.rxLength = 1;
  transfer.minimumPostTransferHighUs = 160;

  Esp32Transport transport;
  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, false);
  const bool valueBits[8] = {true, false, true, false,
                             false, true, false, true};
  for (bool high : valueBits) {
    queueLevel(transport, high);
  }
  queueLevel(transport, true);

  const TransferResult result =
      TestAccess::transfer(transport, transfer, 5000);
  assertCodePhase(result, TransportCode::OK, TransferPhase::STOP);
  TEST_ASSERT_EQUAL_HEX8(0xA5, output);
  TEST_ASSERT_EQUAL_UINT32(1, result.dataBytesTransferred);
  TEST_ASSERT_TRUE(result.firstDeviceAddressAcked);
  TEST_ASSERT_TRUE(result.stopCompleted);

  uint16_t lowIndices[24]{};
  TEST_ASSERT_EQUAL_UINT16(
      18, collectLowEvents(transport, lowIndices, 24));
  const uint16_t hostNackLow = lowIndices[17];
  TEST_ASSERT_EQUAL_UINT32(
      360, TestAccess::lineEventCycle(transport, hostNackLow + 1u) -
               TestAccess::lineEventCycle(transport, hostNackLow));

  uint8_t partialOutput[2] = {0xCC, 0xDD};
  transfer.rxData = partialOutput;
  transfer.rxLength = 2;
  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, false);
  for (uint8_t bit = 0; bit < 8; ++bit) {
    queueLevel(transport, false);
  }
  queueLevel(transport, true);

  const TransferResult partial =
      TestAccess::transfer(transport, transfer, 465);
  assertCodePhase(partial, TransportCode::TIMEOUT,
                  TransferPhase::DATA_READ);
  TEST_ASSERT_EQUAL_UINT32(1, partial.dataBytesTransferred);
  TEST_ASSERT_EQUAL_HEX8(0x00, partialOutput[0]);
  TEST_ASSERT_EQUAL_HEX8(0xDD, partialOutput[1]);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));
}

void test_esp32_released_high_faults_are_typed_and_silent() {
  Esp32Transport transport;
  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, false);
  const TransferResult result =
      TestAccess::transfer(transport, addressOnly(), 5000);
  assertCodePhase(result, TransportCode::LINE_STUCK,
                  TransferPhase::START);
  TEST_ASSERT_FALSE(result.firstDeviceAddressAcked);
  TEST_ASSERT_FALSE(result.stopCompleted);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(transport));

  uint16_t lowIndices[2]{};
  TEST_ASSERT_EQUAL_UINT16(
      0, collectLowEvents(transport, lowIndices, 2));
}

void test_esp32_standard_frame_and_every_address_nack_phase_are_exact() {
  Esp32Transport transport;
  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, false);
  queueLevel(transport, true);
  TransferResult result = TestAccess::transfer(
      transport, addressOnly(SpeedMode::STANDARD_SPEED), 5000);
  assertCodePhase(result, TransportCode::OK, TransferPhase::STOP);

  uint16_t lowIndices[12]{};
  TEST_ASSERT_EQUAL_UINT16(
      9, collectLowEvents(transport, lowIndices, 12));
  for (uint16_t bit = 1; bit < 8; ++bit) {
    TEST_ASSERT_EQUAL_UINT32(
        15360,
        TestAccess::lineEventCycle(transport, lowIndices[bit]) -
            TestAccess::lineEventCycle(transport, lowIndices[bit - 1u]));
  }
  const uint16_t standardAckLow = lowIndices[8];
  TEST_ASSERT_EQUAL_UINT32(
      1680, TestAccess::readCycle(transport, 1) -
                TestAccess::lineEventCycle(transport, standardAckLow));

  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, true);
  queueLevel(transport, true);
  result = TestAccess::transfer(transport, addressOnly(), 5000);
  assertCodePhase(result, TransportCode::NACK,
                  TransferPhase::DEVICE_ADDRESS_WRITE);
  TEST_ASSERT_FALSE(result.firstDeviceAddressAcked);
  TEST_ASSERT_TRUE(result.stopCompleted);

  uint8_t directOutput = 0xA5;
  SingleWireTransfer directRead{};
  directRead.speed = SpeedMode::HIGH_SPEED;
  directRead.deviceAddress = 0xA1;
  directRead.rxData = &directOutput;
  directRead.rxLength = 1;
  directRead.minimumPostTransferHighUs = 160;
  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, true);
  queueLevel(transport, true);
  result = TestAccess::transfer(transport, directRead, 5000);
  assertCodePhase(result, TransportCode::NACK,
                  TransferPhase::DEVICE_ADDRESS_READ);
  TEST_ASSERT_FALSE(result.firstDeviceAddressAcked);
  TEST_ASSERT_EQUAL_HEX8(0xA5, directOutput);
  TEST_ASSERT_TRUE(result.stopCompleted);

  uint8_t readByte = 0;
  SingleWireTransfer randomRead{};
  randomRead.speed = SpeedMode::HIGH_SPEED;
  randomRead.deviceAddress = 0xA0;
  randomRead.hasMemoryAddress = true;
  randomRead.memoryAddress = 0x12;
  randomRead.hasRepeatedStart = true;
  randomRead.repeatedDeviceAddress = 0xA1;
  randomRead.rxData = &readByte;
  randomRead.rxLength = 1;
  randomRead.minimumPostTransferHighUs = 160;

  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, false);
  queueLevel(transport, true);
  queueLevel(transport, true);
  result = TestAccess::transfer(transport, randomRead, 5000);
  assertCodePhase(result, TransportCode::NACK,
                  TransferPhase::MEMORY_ADDRESS);
  TEST_ASSERT_TRUE(result.firstDeviceAddressAcked);
  TEST_ASSERT_FALSE(result.memoryAddressAcked);
  TEST_ASSERT_FALSE(result.repeatedDeviceAddressAcked);
  TEST_ASSERT_TRUE(result.stopCompleted);

  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, false);
  queueLevel(transport, false);
  queueLevel(transport, true);
  queueLevel(transport, true);
  queueLevel(transport, true);
  result = TestAccess::transfer(transport, randomRead, 5000);
  assertCodePhase(result, TransportCode::NACK,
                  TransferPhase::DEVICE_ADDRESS_READ);
  TEST_ASSERT_TRUE(result.firstDeviceAddressAcked);
  TEST_ASSERT_TRUE(result.memoryAddressAcked);
  TEST_ASSERT_FALSE(result.repeatedDeviceAddressAcked);
  TEST_ASSERT_TRUE(result.stopCompleted);
}

