janhavelka/AT21CS11/test/test_esp32_transport.cpp
void test_esp32_random_read_restarts_and_host_ack_policy_are_exact() {
  uint8_t output[2] = {};
  SingleWireTransfer transfer{};
  transfer.speed = SpeedMode::HIGH_SPEED;
  transfer.deviceAddress = 0xA0;
  transfer.hasMemoryAddress = true;
  transfer.memoryAddress = 0x12;
  transfer.hasRepeatedStart = true;
  transfer.repeatedDeviceAddress = 0xA1;
  transfer.rxData = output;
  transfer.rxLength = 2;
  transfer.minimumPostTransferHighUs = 160;

  Esp32Transport transport;
  TestAccess::activateWithoutHardware(transport, -1);
  queueLevel(transport, true);
  queueLevel(transport, false);
  queueLevel(transport, false);
  queueLevel(transport, true);
  queueLevel(transport, false);
  for (uint8_t bit = 0; bit < 8; ++bit) {
    queueLevel(transport, false);
  }
  for (uint8_t bit = 0; bit < 8; ++bit) {
    queueLevel(transport, true);
  }
  queueLevel(transport, true);

  const TransferResult result =
      TestAccess::transfer(transport, transfer, 5000);
  assertCodePhase(result, TransportCode::OK, TransferPhase::STOP);
  TEST_ASSERT_TRUE(result.firstDeviceAddressAcked);
  TEST_ASSERT_TRUE(result.memoryAddressAcked);
  TEST_ASSERT_TRUE(result.repeatedDeviceAddressAcked);
  TEST_ASSERT_EQUAL_UINT32(2, result.dataBytesTransferred);
  TEST_ASSERT_TRUE(result.stopCompleted);
  TEST_ASSERT_EQUAL_HEX8(0x00, output[0]);
  TEST_ASSERT_EQUAL_HEX8(0xFF, output[1]);

  uint16_t lowIndices[48]{};
  TEST_ASSERT_EQUAL_UINT16(
      45, collectLowEvents(transport, lowIndices, 48));
  const uint16_t hostAckLow = lowIndices[35];
  TEST_ASSERT_EQUAL_UINT32(
      2400, TestAccess::lineEventCycle(transport, hostAckLow + 1u) -
                TestAccess::lineEventCycle(transport, hostAckLow));
  const uint16_t hostNackLow = lowIndices[44];
  TEST_ASSERT_EQUAL_UINT32(
      360, TestAccess::lineEventCycle(transport, hostNackLow + 1u) -
               TestAccess::lineEventCycle(transport, hostNackLow));
  TEST_ASSERT_EQUAL_UINT32(
      42240, TestAccess::lineEventCycle(transport, lowIndices[18]) -
                 TestAccess::lineEventCycle(transport, lowIndices[17]));

  const uint8_t standardExpected[8] = {0x00, 0xFF, 0xA5, 0x5A,
                                        0x81, 0x7E, 0x18, 0xE7};
  uint8_t standardOutput[8] = {};
  transfer.speed = SpeedMode::STANDARD_SPEED;
  transfer.rxData = standardOutput;
  transfer.rxLength = sizeof(standardOutput);
  transfer.minimumPostTransferHighUs = 650;

  Esp32Transport standardTransport;
  TestAccess::activateWithoutHardware(standardTransport, -1);
  queueLevel(standardTransport, true);
  queueLevel(standardTransport, false);
  queueLevel(standardTransport, false);
  queueLevel(standardTransport, true);
  queueLevel(standardTransport, false);
  for (uint8_t value : standardExpected) {
    for (int bit = 7; bit >= 0; --bit) {
      queueLevel(standardTransport,
                 ((static_cast<uint32_t>(value) >>
                   static_cast<uint32_t>(bit)) &
                  0x01u) != 0u);
    }
  }
  queueLevel(standardTransport, true);

  const TransferResult standardResult =
      TestAccess::transfer(standardTransport, transfer, 24000);
  assertCodePhase(standardResult, TransportCode::OK,
                  TransferPhase::STOP);
  TEST_ASSERT_TRUE(standardResult.firstDeviceAddressAcked);
  TEST_ASSERT_TRUE(standardResult.memoryAddressAcked);
  TEST_ASSERT_TRUE(standardResult.repeatedDeviceAddressAcked);
  TEST_ASSERT_EQUAL_UINT32(sizeof(standardOutput),
                           standardResult.dataBytesTransferred);
  TEST_ASSERT_TRUE(standardResult.stopCompleted);
  TEST_ASSERT_EQUAL_UINT8_ARRAY(standardExpected, standardOutput,
                                sizeof(standardExpected));
  TEST_ASSERT_EQUAL_UINT16(
      2, TestAccess::criticalEnterCount(standardTransport));
  TEST_ASSERT_EQUAL_UINT16(
      2, TestAccess::criticalExitCount(standardTransport));
  TEST_ASSERT_EQUAL_UINT16(
      0, TestAccess::criticalDepth(standardTransport));
}

void test_esp32_maximum_frames_are_bounded_and_complete() {
  uint8_t writeData[8] = {0x00, 0xFF, 0xA5, 0x5A,
                          0x81, 0x7E, 0x18, 0xE7};
  SingleWireTransfer writeTransfer = addressOnly();
  writeTransfer.txData = writeData;
  writeTransfer.txLength = sizeof(writeData);

  Esp32Transport writeTransport;
  TestAccess::activateWithoutHardware(writeTransport, -1);
  queueLevel(writeTransport, true);
  queueLevel(writeTransport, false);
  for (size_t index = 0; index < sizeof(writeData); ++index) {
    queueLevel(writeTransport, false);
  }
  queueLevel(writeTransport, true);

  const TransferResult writeResult =
      TestAccess::transfer(writeTransport, writeTransfer, 9000);
  assertCodePhase(writeResult, TransportCode::OK, TransferPhase::STOP);
  TEST_ASSERT_TRUE(writeResult.firstDeviceAddressAcked);
  TEST_ASSERT_EQUAL_UINT32(sizeof(writeData),
                           writeResult.dataBytesTransferred);
  TEST_ASSERT_FALSE(writeResult.currentWriteByteMayBeAccepted);
  TEST_ASSERT_TRUE(writeResult.stopCompleted);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(writeTransport));
  TEST_ASSERT_FALSE(TestAccess::testOverflow(writeTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::timingLockAcquireCount(writeTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::timingLockReleaseCount(writeTransport));
  TEST_ASSERT_EQUAL_UINT16(0,
                           TestAccess::timingLockDepth(writeTransport));
  TEST_ASSERT_EQUAL_UINT16(1,
                           TestAccess::criticalEnterCount(writeTransport));
  TEST_ASSERT_EQUAL_UINT16(1,
                           TestAccess::criticalExitCount(writeTransport));
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::criticalDepth(writeTransport));

  uint8_t readData[8]{};
  const uint8_t expected[8] = {0x00, 0xFF, 0xA5, 0x5A,
                               0x81, 0x7E, 0x18, 0xE7};
  SingleWireTransfer readTransfer{};
  readTransfer.speed = SpeedMode::HIGH_SPEED;
  readTransfer.deviceAddress = 0xA1;
  readTransfer.rxData = readData;
  readTransfer.rxLength = sizeof(readData);
  readTransfer.minimumPostTransferHighUs = 160;

  Esp32Transport readTransport;
  TestAccess::activateWithoutHardware(readTransport, -1);
  queueLevel(readTransport, true);
  queueLevel(readTransport, false);
  for (uint8_t value : expected) {
    for (int bit = 7; bit >= 0; --bit) {
      queueLevel(readTransport,
                 ((static_cast<uint32_t>(value) >>
                   static_cast<uint32_t>(bit)) &
                  0x01u) != 0u);
    }
  }
  queueLevel(readTransport, true);

  const TransferResult readResult =
      TestAccess::transfer(readTransport, readTransfer, 9000);
  assertCodePhase(readResult, TransportCode::OK, TransferPhase::STOP);
  TEST_ASSERT_TRUE(readResult.firstDeviceAddressAcked);
  TEST_ASSERT_EQUAL_UINT32(sizeof(readData),
                           readResult.dataBytesTransferred);
  TEST_ASSERT_TRUE(readResult.stopCompleted);
  TEST_ASSERT_EQUAL_UINT8_ARRAY(expected, readData, sizeof(expected));
  TEST_ASSERT_TRUE(TestAccess::lineReleased(readTransport));
  TEST_ASSERT_FALSE(TestAccess::testOverflow(readTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::timingLockAcquireCount(readTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::timingLockReleaseCount(readTransport));
  TEST_ASSERT_EQUAL_UINT16(0,
                           TestAccess::timingLockDepth(readTransport));
  TEST_ASSERT_EQUAL_UINT16(1,
                           TestAccess::criticalEnterCount(readTransport));
  TEST_ASSERT_EQUAL_UINT16(1,
                           TestAccess::criticalExitCount(readTransport));
  TEST_ASSERT_EQUAL_UINT16(0, TestAccess::criticalDepth(readTransport));

