janhavelka/AT21CS11/test/test_esp32_transport.cpp
  SingleWireTransfer standardTransfer = addressOnly(
      SpeedMode::STANDARD_SPEED);
  standardTransfer.hasMemoryAddress = true;
  standardTransfer.memoryAddress = 0x20;
  standardTransfer.txData = writeData;
  standardTransfer.txLength = sizeof(writeData);
  standardTransfer.minimumPostTransferHighUs = 650;

  Esp32Transport standardTransport;
  TestAccess::activateWithoutHardware(standardTransport, -1);
  queueLevel(standardTransport, true);
  queueLevel(standardTransport, false);
  queueLevel(standardTransport, false);
  for (size_t index = 0; index < sizeof(writeData); ++index) {
    queueLevel(standardTransport, false);
  }
  queueLevel(standardTransport, true);

  const TransferResult standardResult =
      TestAccess::transfer(standardTransport, standardTransfer, 9000);
  assertCodePhase(standardResult, TransportCode::OK,
                  TransferPhase::STOP);
  TEST_ASSERT_TRUE(standardResult.firstDeviceAddressAcked);
  TEST_ASSERT_EQUAL_UINT32(sizeof(writeData),
                           standardResult.dataBytesTransferred);
  TEST_ASSERT_TRUE(standardResult.stopCompleted);
  TEST_ASSERT_TRUE(TestAccess::lineReleased(standardTransport));
  TEST_ASSERT_FALSE(TestAccess::testOverflow(standardTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::timingLockAcquireCount(standardTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::timingLockReleaseCount(standardTransport));
  TEST_ASSERT_EQUAL_UINT16(0,
                           TestAccess::timingLockDepth(standardTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::criticalEnterCount(standardTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::criticalExitCount(standardTransport));
  TEST_ASSERT_EQUAL_UINT16(0,
                           TestAccess::criticalDepth(standardTransport));

  Esp32Transport standardNackTransport;
  TestAccess::activateWithoutHardware(standardNackTransport, -1);
  queueLevel(standardNackTransport, true);
  queueLevel(standardNackTransport, false);
  queueLevel(standardNackTransport, true);
  queueLevel(standardNackTransport, true);
  const TransferResult standardNack =
      TestAccess::transfer(standardNackTransport, standardTransfer, 9000);
  assertCodePhase(standardNack, TransportCode::NACK,
                  TransferPhase::MEMORY_ADDRESS);
  TEST_ASSERT_TRUE(standardNack.firstDeviceAddressAcked);
  TEST_ASSERT_FALSE(standardNack.memoryAddressAcked);
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::criticalEnterCount(standardNackTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::criticalExitCount(standardNackTransport));
  TEST_ASSERT_EQUAL_UINT16(
      0, TestAccess::criticalDepth(standardNackTransport));

  Esp32Transport standardTimeoutTransport;
  TestAccess::activateWithoutHardware(standardTimeoutTransport, -1);
  queueLevel(standardTimeoutTransport, true);
  queueLevel(standardTimeoutTransport, false);
  queueLevel(standardTimeoutTransport, false);
  const TransferResult standardTimeout =
      TestAccess::transfer(standardTimeoutTransport, standardTransfer, 2300);
  assertCodePhase(standardTimeout, TransportCode::TIMEOUT,
                  TransferPhase::DATA_WRITE);
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::criticalEnterCount(standardTimeoutTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::criticalExitCount(standardTimeoutTransport));
  TEST_ASSERT_EQUAL_UINT16(
      0, TestAccess::criticalDepth(standardTimeoutTransport));

  uint8_t standardReadData[8]{};
  SingleWireTransfer standardRead{};
  standardRead.speed = SpeedMode::STANDARD_SPEED;
  standardRead.deviceAddress = 0xA1;
  standardRead.rxData = standardReadData;
  standardRead.rxLength = sizeof(standardReadData);
  standardRead.minimumPostTransferHighUs = 650;

  Esp32Transport standardReadTransport;
  TestAccess::activateWithoutHardware(standardReadTransport, -1);
  queueLevel(standardReadTransport, true);
  queueLevel(standardReadTransport, false);
  for (uint8_t value : expected) {
    for (int bit = 7; bit >= 0; --bit) {
      queueLevel(standardReadTransport,
                 ((static_cast<uint32_t>(value) >>
                   static_cast<uint32_t>(bit)) &
                  0x01u) != 0u);
    }
  }
  queueLevel(standardReadTransport, true);

  const TransferResult standardReadResult =
      TestAccess::transfer(standardReadTransport, standardRead, 9000);
  assertCodePhase(standardReadResult, TransportCode::OK,
                  TransferPhase::STOP);
  TEST_ASSERT_TRUE(standardReadResult.firstDeviceAddressAcked);
  TEST_ASSERT_EQUAL_UINT32(sizeof(standardReadData),
                           standardReadResult.dataBytesTransferred);
  TEST_ASSERT_TRUE(standardReadResult.stopCompleted);
  TEST_ASSERT_EQUAL_UINT8_ARRAY(expected, standardReadData,
                                sizeof(expected));
  TEST_ASSERT_TRUE(TestAccess::lineReleased(standardReadTransport));
  TEST_ASSERT_FALSE(TestAccess::testOverflow(standardReadTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::timingLockAcquireCount(standardReadTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::timingLockReleaseCount(standardReadTransport));
  TEST_ASSERT_EQUAL_UINT16(
      0, TestAccess::timingLockDepth(standardReadTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::criticalEnterCount(standardReadTransport));
  TEST_ASSERT_EQUAL_UINT16(
      1, TestAccess::criticalExitCount(standardReadTransport));
  TEST_ASSERT_EQUAL_UINT16(
      0, TestAccess::criticalDepth(standardReadTransport));
}

void test_esp32_instances_keep_descriptors_pins_and_line_state_independent() {
  Esp32Transport first;
  Esp32Transport second;
  Esp32TransportConfig firstConfig{};
  firstConfig.sioPin = 1;
  Esp32TransportConfig secondConfig{};
  secondConfig.sioPin = 33;
  TEST_ASSERT_TRUE(first.begin(firstConfig).ok());
  TEST_ASSERT_TRUE(second.begin(secondConfig).ok());
  const SingleWireTransport firstDescriptor = first.descriptor();
  const SingleWireTransport secondDescriptor = second.descriptor();
  TEST_ASSERT_EQUAL_PTR(&first, firstDescriptor.user);
  TEST_ASSERT_EQUAL_PTR(&second, secondDescriptor.user);
  TEST_ASSERT_NOT_EQUAL(firstDescriptor.user, secondDescriptor.user);
  TEST_ASSERT_EQUAL_INT(1, TestAccess::sioPin(first));
  TEST_ASSERT_EQUAL_INT(33, TestAccess::sioPin(second));

  const uint16_t secondEventsBefore = TestAccess::lineEventCount(second);
  queueLevel(first, false);
  const TransferResult firstResult =
      firstDescriptor.transfer(addressOnly(), 5000, firstDescriptor.user);
  assertCodePhase(firstResult, TransportCode::LINE_STUCK,
                  TransferPhase::START);
  TEST_ASSERT_EQUAL_UINT16(secondEventsBefore,
                           TestAccess::lineEventCount(second));
  TEST_ASSERT_TRUE(TestAccess::lineReleased(second));
  TEST_ASSERT_EQUAL_PTR(secondDescriptor.user, second.descriptor().user);
  TEST_ASSERT_EQUAL_PTR(secondDescriptor.transfer,
                        second.descriptor().transfer);

  first.end();
  TEST_ASSERT_TRUE(TestAccess::lineReleased(first));
  TEST_ASSERT_EQUAL_INT(-1, TestAccess::sioPin(first));
  TEST_ASSERT_TRUE(second.isInitialized());
  TEST_ASSERT_EQUAL_PTR(&second, second.descriptor().user);
  TEST_ASSERT_EQUAL_UINT16(secondEventsBefore,
                           TestAccess::lineEventCount(second));
}

void test_esp32_public_begin_end_and_presence_paths() {
  Esp32Transport invalid;
  Esp32TransportConfig invalidConfig{};
  invalidConfig.sioPin = -1;
  TEST_ASSERT_TRUE(invalid.begin(invalidConfig).is(Err::INVALID_CONFIG));
  TEST_ASSERT_EQUAL_UINT32(0, TestAccess::platformAccessCount(invalid));
  TEST_ASSERT_FALSE(invalid.isInitialized());

  invalidConfig.sioPin = 1;
  invalidConfig.presencePin = -2;
  TEST_ASSERT_TRUE(invalid.begin(invalidConfig).is(Err::INVALID_CONFIG));
  invalidConfig.presencePin = 49;
  TEST_ASSERT_TRUE(invalid.begin(invalidConfig).is(Err::INVALID_CONFIG));
  invalidConfig.presencePin = 1;
  TEST_ASSERT_TRUE(invalid.begin(invalidConfig).is(Err::INVALID_CONFIG));
  invalidConfig.sioPin = 49;
  invalidConfig.presencePin = -1;
  TEST_ASSERT_TRUE(invalid.begin(invalidConfig).is(Err::INVALID_CONFIG));
  TEST_ASSERT_EQUAL_UINT32(0, TestAccess::platformAccessCount(invalid));
  TEST_ASSERT_FALSE(invalid.isInitialized());

  Esp32Transport activeHigh;
  Esp32TransportConfig highConfig{};
  highConfig.sioPin = 1;
  highConfig.presencePin = 2;
  highConfig.presenceActiveHigh = true;
  TEST_ASSERT_TRUE(activeHigh.begin(highConfig).ok());
  const uint32_t highAccessAfterBegin =
      TestAccess::platformAccessCount(activeHigh);
  TEST_ASSERT_TRUE(activeHigh.begin(highConfig).is(Err::INVALID_STATE));
  TEST_ASSERT_EQUAL_UINT32(highAccessAfterBegin,
                           TestAccess::platformAccessCount(activeHigh));
  TEST_ASSERT_TRUE(activeHigh.isInitialized());
  const SingleWireTransport highDescriptor = activeHigh.descriptor();
  TEST_ASSERT_NOT_NULL(highDescriptor.readPresence);
  TestAccess::setPresenceLevel(activeHigh, true);
  TestAccess::setNowUs(activeHigh, 10);
  const uint16_t highLineEvents = TestAccess::lineEventCount(activeHigh);
  bool present = false;
  TransferResult result = highDescriptor.readPresence(
      present, 11, highDescriptor.user);
  assertCodePhase(result, TransportCode::OK, TransferPhase::PRESENCE);
  TEST_ASSERT_TRUE(present);
  TEST_ASSERT_EQUAL_UINT16(highLineEvents,
                           TestAccess::lineEventCount(activeHigh));

  present = true;
  result = highDescriptor.readPresence(present, 10, highDescriptor.user);
  assertCodePhase(result, TransportCode::TIMEOUT, TransferPhase::PRESENCE);
  TEST_ASSERT_FALSE(present);
  TEST_ASSERT_EQUAL_UINT16(highLineEvents,
                           TestAccess::lineEventCount(activeHigh));

  Esp32Transport activeLow;
  Esp32TransportConfig lowConfig{};
  lowConfig.sioPin = 33;
  lowConfig.presencePin = 34;
  lowConfig.presenceActiveHigh = false;
  TEST_ASSERT_TRUE(activeLow.begin(lowConfig).ok());
  const SingleWireTransport lowDescriptor = activeLow.descriptor();
  TestAccess::setPresenceLevel(activeLow, false);
  TestAccess::setNowUs(activeLow, 20);
  present = false;
  result = lowDescriptor.readPresence(present, 21, lowDescriptor.user);
  assertCodePhase(result, TransportCode::OK, TransferPhase::PRESENCE);
  TEST_ASSERT_TRUE(present);

  Esp32Transport noPresence;
  Esp32TransportConfig noPresenceConfig{};
  noPresenceConfig.sioPin = 3;
  TEST_ASSERT_TRUE(noPresence.begin(noPresenceConfig).ok());
  TEST_ASSERT_NULL(noPresence.descriptor().readPresence);

  activeHigh.end();
  activeLow.end();
  noPresence.end();
}
